const batch2 = [
    // حرف الألف
    {letter: 'أ', q:"حجر كريم ومعدن طبيعي يعتبر الأصلب بين كل المعادن ويستخدم للزينة وأيضاً لقطع الزجاج باحتراف؟", a:"ألماس"},
    {letter: 'أ', q:"الغاز الذي يشكل النسبة الأهم للكائنات الحية لا تستطيع العيش والتنفس بدونه دقيقة واحدة ويمثل في الطبيعة بالرمز O2؟", a:"أكسجين"},
    {letter: 'أ', q:"قارة ضخمة اكتشفها كريستوفر كولومبس وتعتبر اليوم منبع الاقتصاد العالمي ومن أقوى دول العالم وأشرسها سياسيا؟", a:"أمريكا (الولايات المتحدة الأمريكية)"},
    {letter: 'أ', q:"تراكيب صلبة بيضاء توجد في الوجنين وتستخدم في تقطيع ومضغ الطعام وتتعرض للتسوس إذا أُهمل تنظيفها المستمر؟", a:"أسنان"},
    
    // حرف الباء
    {letter: 'ب', q:"المدخل أو المخرج الخشبي والحديدي الأساسي لأي غرفة أو منزل والذي نفتحه لندخل للداخل المغلق؟", a:"باب"},
    {letter: 'ب', q:"مصدر بروتيني حيواني مهم جداً في الإفطار الصباحي وتنتجه الدجاجات بكثرة، و قشرتها البيضاء هشة جدا تنكسر بسرعة؟", a:"بيضة"},
    {letter: 'ب', q:"الدولة الأوروبية العظمى تاريخياً ويُضرب بها المثل بـ (التي لا تغيب عنها الشمس) وعاصمتها الحالية هي مدينة لندن العرقية؟", a:"بريطانيا"},
    {letter: 'ب', q:"نوع شهير ولذيذ جداً من المكسرات البينة الدائرية الصعبة الكسر، ويستخدم بكثرة مع الشوكولاتة والحلويات الأوروبية؟", a:"بندق"},

    // حرف التاء
    {letter: 'ت', q:"علم دراسة وسرد الأحداث الزمنية الماضية للأمم والحضارات القديمة لنتعلم من إنجازاتهم وهفواتهم السابقة العظيمة؟", a:"تاريخ"},
    {letter: 'ت', q:"مجسم فني من الطين أو البرونز أو الرخام يُنحت ليشبه إنساناً أو وحشاً لتخليد ذكرى معينة في الساحات المركزية والمتاحف؟", a:"تمثال"},
    {letter: 'ت', q:"الورقة المطبوعة والصغيرة التي تشتريها قبل صعودك لرحلة بالطائرة أو حجزك كرسيا في فيلم بصالة السينما الفاخرة؟", a:"تذكرة"},
    {letter: 'ت', q:"أخان أو شقيقتان يولدان من رحم واحد وفي نفس اللحظة تقريباً، وقد يكونان متطابقين تماماً لدرجة عدم التفريق شكليا؟", a:"توأم"},

    // حرف الثاء
    {letter: 'ث', q:"الحالة الفيزيائية المتجمدة والمتبلورة للماء البارد جداً وتتساقط في فصل الشتاء لتكسو المدن باللون الأبيض الناصع والصافي؟", a:"ثلج"},
    {letter: 'ث', q:"الحيوان البري الماكر والذكي جداً الذي يُضرب به المثل المشهور للاحتيال والذي يحب السطو الدائم على حظائر الدجاج المسالم؟", a:"ثعلب"},
    {letter: 'ث', q:"مصدر الإنارة المعلق أو النجفة الكبيرة والمزخرفة بالكريستال التي تتدلى من أسقف القصور والغرف الفاخرة للزينة الهائلة؟", a:"ثريا"},
    {letter: 'ث', q:"انتفاضة شعبية ونهضة تغيير قوية تهدف للإطاحة بنظام حاكم جائر للبحث عن الاستقلال وتحسين الأوضاع المعيشية المتأزمة كلياً؟", a:"ثورة"},

    // حرف الجيم
    {letter: 'ج', q:"الكلمة التي تعبر عن أقصى وأقسى درجات العذاب ودار النار الأبدية للحساب وتعرف أيضاً باسم (جهنم) المتقدة والمشتعلة؟", a:"جحيم"},
    {letter: 'ج', q:"العظام الواقية الصلبة جداً في أعلى الرأس وأهم وظيفة لها هي حماية الدماغ الحساس من الصدمات والارتطام المستمر؟", a:"جمجمة"},
    {letter: 'ج', q:"مدينة سعودية وبوابة للحرمين تجاور البحر الأحمر وتعتبر العاصمة الاقتصادية والسياحية للمملكة و(جدة غير) وعروس البحر؟", a:"جدة"},
    {letter: 'ج', q:"البناء الهندسي القوي المُعلق الذي يُربط ويُشيد بين ضفتين لتعبر فوقه السيارات أو القطارات ويختصر المسافات والمستنقعات؟", a:"جسر"},

    // حرف الحاء
    {letter: 'ح', q:"سائل ملون وأسود لزج كان يستخرج من الحبارات ويصنع معمليا ويستخدم للكتابة بالریشة أو يُعبأ به القلم والأسطوانات للطباعة؟", a:"حبر"},
    {letter: 'ح', q:"المعدن الثقيل والأقوى والأكثر استخداماً في التشييد العمراني والصناعات، والذي ذُكر بالقرآن بأن فيه (بأس شديد ومنافع للناس)؟", a:"حديد"},
    {letter: 'ح', q:"الجهاز الإلكتروني المتطور والأساسي الذي يعالج البيانات المعقدة والصور والألعاب ويسمى باللغة الإنجليزية (كمبيوتر / Computer)؟", a:"حاسوب"},
    {letter: 'ح', q:"الوعاء القماشي أو الجلدي المتنوع الأحجام والمزود بسحابات الذي يحافظ على الأمتعة والأغراض المدرسية أو يرافقنا بالسفر البعيد؟", a:"حقيبة"},

    // حرف الخاء
    {letter: 'خ', q:"حرفة ومهنة ماهرة ودقيقة لربط ونسج الأقمشة المفصلة ببعضها عن طريق الخيط الطبيعي والإبرة الصغيرة لصنع ملابس محبوكة ودافئة؟", a:"خياطة"},
    {letter: 'خ', q:"الغذاء الأبرز والأساسي لشعوب الأرض الذي يشبع ويصنع من الدقيق الأسمر والأبيض والمُحمر بالفرن ولا تستغني عنه السفرة اليومية الشاملة؟", a:"خبز"},
    {letter: 'خ', q:"الفصل الذي يلي الصيف وفيه تتساقط أوراق الأشجار الذهبية البنية وتهاجر فيه الطيور هرباً من البرد والرياح المستعدة للقدوم الطويل؟", a:"خريف"},
    {letter: 'خ', q:"المسكن والمتنقل من القماش والوبر والأعمدة والمستخدم عند البدو في الصحاري وفي التخييم والمكشات والمغامرات خارج المدن والتطور المستمر؟", a:"خيمة"},

    // حرف الدال
    {letter: 'د', q:"المجموعة البيضاء من الأوراق المرتبة والمسطرة بشكل منتظم والتي يعتمد عليها الطلاب للكتابة المدرسية الخالصة والملاحظات الطويلة الدؤوبة؟", a:"دفتر"},
    {letter: 'د', q:"المادة الكيميائية والعلاجية السائلة أو المعبأة في كبسولات صغيرة التي يصفها الطبيب لتخفيف الآلام ومحاربة الأمراض الشديدة المزمنة والمؤلمة؟", a:"دواء"},
    {letter: 'د', q:"حيوان بري ضخم جداً ومحب بشدة للأسماك والعسل الجبلي ويشتهر بنومه العميق المستمر طوال فترة الشتاء القاسية بالبيات والتوقف عن الصيد؟", a:"دب"},
    {letter: 'د', q:"العضو البشري المعقد والرئيسي في جسم الإنسان والحيوان والذي يتحكم في الجهاز العصبي والتفكير والذكاء والأحاسيس والذاكرة طويلة المدى والمحجوبة؟", a:"دماغ"},

    // حرف الذال
    {letter: 'ذ', q:"المنطقة البارزة والسفلية في حافة الفك ووجه الإنسان من الأسفل تماماً وينمو فيها الشعر وتسمى أحيانا باللغة الدارجة والدينية بـ(اللحية) في الرجال الكبار؟", a:"ذقن"},
    {letter: 'ذ', q:"الجزء والممتد الخلفي الطويل أو القصير المرتبط بالعمود الفقري للحيوانات ذوات الأربع ويستخدم غالبا في إحداث توازن لحركتها اليومية أو طرد الحشرات و التعبير؟", a:"ذيل"},
    {letter: 'ذ', q:"حشرة طائرة طفيلية ومزعجة بشدة، تُطارد الأطعمة المفتوحة والمكشوفة بشكل مقزز وتنقل الجراثيم والمرض الصامت، ولها قصة التحدي مع الذين كُفروا في سورة الحج؟", a:"ذباب (ذبابة)"},
    {letter: 'ذ', q:"النبات الزراعي الأصفر الشهي ذو الحبوب المتلاصقة، والذي يتم قليه ومفرقعته أو تسخينه لصناعة الفشار (البوب كورن) الممتع كوجبة متلازمة وخفيفة بمشاهدة الأفلام؟", a:"ذرة"},

    // حرف الراء
    {letter: 'ر', q:"أهم وأعلى جزء علوي في جسم الإنسان ويحتوي بالداخل على الدماغ الحساس وتبرز منه الحواس الخمس كالسمع والبصر والشم والذوق للتمييز والحواس والإدراك الجسدي والنفسي والعقلي؟", a:"رأس"},
    {letter: 'ر', q:"حبيبات التراب الناعمة جداً والمتطايرة والمتفتتة من الصخور التي تغطي وتعقم بضخامتها الصحاري الحارقة القاحلة والسواحل الذهبية الجميلة والشواطئ التي تضرب فيها الأمواج العاتية العالية؟", a:"رمل"},
    {letter: 'ر', q:"الغطاء الإلي والمخملي الخارجي الذي ينمو ليكسو ويعزل جسم الطيور ويساعدها على التحليق والطيران، وكان يُغمس زمانا في الحبر الأسود ليستخدم كأداة راقية وكلاسيكية للكتابة الفنية الممتعة والناعمة والأشعار؟", a:"ريشة"},
    {letter: 'ر', q:"العاصمة السياسية والاقتصادية والأكبر للمملكة العربية السعودية والتي تقع في قلب نجد وتشهد تطوراً عمرانياً ونمواً لا يهدأ واستضافة لأكبر المهرجانات والحفلات الشتوية الفريدة و المتألقة والبوليفارد والمنافسات الآسيوية؟", a:"رياض (الرياض)"},

    // حرف الزاي
    {letter: 'ز', q:"المادة الصلبة الهشة الشفافة جداً والتي تصنع كيميائيا وحراريا من إذابة الرمل الناعم الصافي وتستخدم في النوافذ والكؤوس والأواني وتنكسر فورا بقوة عند سقوطها أو اصطدامها بحجر قاسي أو مقذوف صارم ومباغت؟", a:"زجاج"},
    {letter: 'ز', q:"السائل الدهني والكثيف والطبيعي الذي يتم عصره وصحياً استخراجه من شجرة الزيتون المباركة ويعتبر الأفضل والصحي للطبخ والأكل والدهن والشفاء الجسدي والعضلي ويغلب لونه على النقاء الذهبي القوي والأخضر المضيء والعاكس في الحوض؟", a:"زيت"},
    {letter: 'ز', q:"حجر كريم ومعدن نفيس غالي الثمن و نادر يتميز وينفرد بلونه الأخضر الشديد الخضرة العاكس للضوء والذي استخدم في تزيين المجوهرات المرصعة وتيجان السلاطين والأمراء قديما وصنعوا منه قلائد ساحرة ومدهشة الجمال والتحف الثمينة؟", a:"زمرد"},
    {letter: 'ز', q:"هزات وتصدعات أرضية وتكتونية مدمرة ومرعبة وقوية تضرب فجأة من عمق ومحيط الكرة الأرضية لتدمير البنى التحتية والتجمعات السكنية الشامخة وتقاس قوتها بمقياس عالمي شهير يسمى (ريختر) وقد يصاحبها موجات التسونامي للأسف والهول؟", a:"زلازل"},

    // حرف السين
    {letter: 'س', q:"قطعة الأثاث الخشبية أو المعدنية الإسفنجية المريحة جداً والمزودة بالمراتب والوسائد القطنية المعقمة الناعمة والمخصصة للنوم اليومي والاسترخاء المتواصل في الليل بعد يوم شاق ومتعب من الإرهاق المستمر لراحة الجسد المتألم وحفظ الظهر؟", a:"سرير"},
    {letter: 'س', q:"الأداة الحادة والمعدنية الأساسية جداً والخطيرة في المطبخ والمطعم والتي نعتمد عليها بشكل مستمر للتقطيع السريع وتقشير الفواكه الباسطة والمنتجات القاسية وتمتلك مقبضا خشبيا حاميا لعدم جرح اليدين والتورط بالدم القوي والأورام الدقيقة والمستعصية؟", a:"سكين"},
    {letter: 'س', q:"المركبة البحرية والتجارية العملاقة والمحركة أو الشراعية العتيقة قديما والتي تطفو بقوة قانون الطفو الفيزيائي وتمضي لأسابيع وشهور وأيام على سطح الماء الأزرق العميق لنقل الركاب المئات والبضائع الضخمة حول قارات العالم بأمان واستقرار ملاحي وإبحار؟", a:"سفينة"},
    {letter: 'س', q:"كتلة من بخار الماء المتكاثفة بقوة في طبقات الجو العالية وتأتينا باللون الأبيض أو الرمادي الداكن المبشر القاتم الممتلئ والواثق بمشيئة الله لتمطرنا وتسقي الأرض الظمأى والأنعام والزرع المتلهف بقطرات هطولية قوية وصواعق وبرق مهيبة ومنتصرة وعجيبة؟", a:"سحاب"},

    // حرف الشين
    {letter: 'ش', q:"مصدر إضاءة شمعي يعتمد في آلية عمله على احتراق الفتيل القطني ببطء شديد وكانت هي الوسيلة الرومانسية والسائدة جداً قديماً لإنارة الغرف في الليالي الحالكة قبل اختراع الكهرباء؟", a:"شمعة"},
    {letter: 'ش', q:"المنطقة الرملية الناعمة والدافئة التي تفصل وتكون محاذية لساحل البحر مباشرة حيث يمارس الناس الاسترخاء والاصطياف والمشي وبناء القلاع في أوقات العطلات الجوية المشمسة المريحة والصافية المائجة؟", a:"شاطئ"},
    {letter: 'ش', q:"الحلوى بنية اللون واللذيذة جداً والتي يحبها ويعشقها الصغار والكبار وتصنع وتستخرج وتمر من حقول حبوب الكاكاو الغنية وتقدم سائلة أو صلبة ومغلفة بورق ذهبي وفضي وفي المناسبات الفارهة العالية المستوى كهدية جميلة رائعة؟", a:"شوكولاتة (كاكاو - شوكولا)"},
    {letter: 'ش', q:"مدينة أمريكية كبرى وصناعية شديدة البرودة ومشهورة تاريخياً وعالمياً بناطحات السحاب الشاهقة والتي طالما عُرفت و لُقبت باسم (مدينة الرياح) العاصفة وتقع في ولاية إلينوي الهادئة؟", a:"شيكاغو"},

    // حرف الصاد
    {letter: 'ص', q:"مادة التنظيف الرغوية الضرورية اليومية التي لاغنى عنها والمصنوعة من مواد معطرة وزيوت وفعالة لغسل اليدين وإزالة الأوساخ والبكتيريا والجراثيم بشكل قاطع وسريع في دورات المياه والحمامات؟", a:"صابون"},
    {letter: 'ص', q:"المركبة الأسطوانية الفضائية المذهلة والمزودة بمحركات دفع ونفاثات نارية قوية تنطلق وتكسر وتخترق الغلاف الجوي الصريح والقاسي نحو الفضاء المجهول الخارجي؟", a:"صاروخ"},
    {letter: 'ص', q:"دولة ونمر أسيوي وتعتبر الأكبر والأضخم عالمياً وثقلا اقتصاديا من حيث عدد السكان التاريخي والمصانع وتشتهر في ثقافتها بالتنين الذهبي والطعام بالمعكرونة وبسورها الحجري الطويل الأطول بالتاريخ؟", a:"صين (الصين)"},
    {letter: 'ص', q:"الشيء غير المرئي الذي تسمعه الأذن البشرية و ينتقل فيزيائياً عبر الذبذبات والموجات الهوائية ولا يستطيع التنقل والانتقال تماما واستحالةً في الفضاء المفرغ الساكن؟", a:"صوت"},

    // حرف الضاد
    {letter: 'ض', q:"بناء أو مزار ديني ومقابر مقدسة يُقام أحياناً على حفرة القبر تخليداً لصاحبه وتعلوه في بعض الأديان والحضارات قباب مهيبة هندسية ومزخرفة ومبالغ كبيرا جدا بلمساتها التاريخية الباهرة؟", a:"ضريح"},
    {letter: 'ض', q:"السحاب الأبيض الكثيف والرطب والبارد جداً الذي يلامس ويفترش مستوى وحوض سطح الأرض صباحاً ويحجب إطارات الرؤية كلياً ويتسبب في كثير من الحوادث المرورية وانعدام الأمان في القيادة المرورية الشتوية؟", a:"ضباب"},
    {letter: 'ض', q:"الرتبة العسكرية والسلطانية أو الحكومية العليا في أجهزة الشرطة المرورية والجنائية أو الجيش لحفظ الأمن وإدارة القوة الميدانية والدفاع عن المدنيين ومكافحة التجاوزات الصارخة بحزم ورتب وحكمة؟", a:"ضابط"},
    {letter: 'ض', q:"الخصلات والتسريحة الأنثوية الجميلة للشعر وهي المظفورة والمجدولة الطويلة والأنيقة التي تصففها وتعشقها وتحبها البنات في المرحلة الابتدائية والمدارس بـ(شبرات) ملونة لطيفة؟", a:"ضفائر (ظفائر، لكن الصحيح ضفائر)"},

    // حرف الطاء
    {letter: 'ط', q:"الشخص المهني والمُؤهل والدارس لسنوات طويلة في التشريح والعلوم ليقوم ويشخص ويعالج مرضاكم والمصابين ويصف لك الدواء الشافي والأشعة والعمليات الجراحية العسيرة ببراغماتية عالية وعلمية وصحية؟", a:"طبيب (دكتور)"},
    {letter: 'ط', q:"التراب الأسمر الناعم المختلط بالماء اللزج ويستخدم بشدة ومكثفا في القرى والبناء القديم للأكواخ وصناعة الفخاريات والجماليات والأواني الريفية الدافئة البسيطة المعمرة التي تقاوم أشد أنواع الحر والصيف؟", a:"طين"},
    {letter: 'ط', q:"المادة والإصبع الجيري الهش والأبيض (أو الملون) والذي كان يستخدم تاريخيا للكتابة بقوة وخربشة على اللوحة المدرسية السوداء العريضة قديما قبل اختراع الأقلام البيضاء المغناطيسية السلسة القوية؟", a:"طباشير"},
    {letter: 'ط', q:"الوعاء المسطح أو المفلطح الزجاجي أو المعدني والذي يقدم ويُفرش عليه الطعام والكبسات والمشاوي على مائدة الغداء أو العشاء بأحجام صغيرة وكبيرة وولائم عائلية كريمة؟", a:"طبق (صحن)"},

    // حرف الظاء
    {letter: 'ظ', q:"انعدام الضوء التام والهدوء وسواد الليل الحالك المخيف والذي تغيب فيه الرؤية المطلقة وتكثر فيه الأساطير والقصص الكاذبة عن الأشباح المخيفة الخيالية المرعبة؟", a:"ظلام"},
    {letter: 'ظ', q:"الغلاف الورقي أو الكرتوني المغلق الذي تخبأ بداخله الرسائل السرية أو الأموال النقدية لإرسالها لأماكن وشخصيات كهدية أو رسالة بريدية ولها ختم ورقي يوثق مسارها الطويل والعابر؟", a:"ظرف"},
    {letter: 'ظ', q:"التعدي الجارف وأكل حقوق الآخرين الأبرياء بالباطل وهي الكلمة العكسية والنقيضة للعدل والإنصاف ولديها عواقب وخيمة في الشرع والقانون وتعتبر دمارا مستمرا للمجتمعات؟", a:"ظلم"},
    {letter: 'ظ', q:"الجزء الخلفي المتين للجسد والمستند القوي والساند لجذع وعظام الإنسان والحيوان والذي يحمل الأثقال غالبا ويتعرض للإصابات والديسك القاسي والمؤلم بحمل الأوزان الثقيلة الطائشة المتهورة؟", a:"ظهر"},

    // حرف العين
    {letter: 'ع', q:"الهيكل الداخلي الصلب والمتصلب بالكامل والذي يعطي دعامة لجسم وتكوين الحيوان والإنسان ويدفن تحت التراب ويبقى لملايين السنين شامخا ومتحجرا ويدل على حجم الكائن كالديناصورات المتوحشة؟", a:"عظم"},
    {letter: 'ع', q:"المشروب السائل البارد والمستخلص والمعصور والمُحلى غالبا من الفاكهة الطازجة والبرتقال ليروي ولينعش شاربه ويمده بالفيتامينات الأساسية اليومية والحيوية المستمرة المنطلقة والمريحة؟", a:"عصير"},
    {letter: 'ع', q:"المادة السائلة والمقطرة القوية والطيبة الرائحة التي يرتديها ويُتعطر بها الناس من البخاخات الجذابة لترك أثر وانطباع فواح وقوي في الجو و والمناسبات والاجتماعات الضخمة والمقابلات؟", a:"عطر"},
    {letter: 'ع', q:"حيوان مفصلي سام ومخيف جدا يعيش متخفيا تحت الحجارة، وبجسمه الدروع ويمتلك ويلهث بلسعة خطيرة جدا ومُهلكة مميتة في إبرة ذيله الشوكي السام المنحني للأمام بحذر؟", a:"عقرب"},

    // حرف الغين
    {letter: 'غ', q:"تجمع بخار الماء المعلق والكثيف في السماء والذي يسير تحمله الرياح الخفيفة والثقيلة استعداداً للمطر والرعد والبرق ليروي العطاس ويسقي القفر ويغير المناخ الصحراوي لأجواء لطيفة وجميلة وشاعرية؟", a:"غيوم"},
    {letter: 'غ', q:"المركبة البحرية والعسكرية السوداء التي تستطيع ولا زالت الغوص بسلام وثبات إلى أعمق أعماق ومناطق المحيطات المظلمة وتطلق طوربيدات حربية قذائفية متطورة جدا وموجهة بقوة وتخفي وإخفاء بالرادار؟", a:"غواصة"},
    {letter: 'غ', q:"الحجرة أو الحيز المربع أو الهندسي المحاط بأربع جدران وسقف صلب داخل المنزل ليحتوي سريرك وخزانة الملابس والتفاصيل الخصوصية الحياتية للفرد للعيش والدراسة والمكوث بأمان ونظافة مستمرة؟", a:"غرفة"},
    {letter: 'غ', q:"دقائق التراب الدقيقة والرقيقة جدا جدا والمتطايرة بغزارة في الهواء القاسي والعواصف الشتوية الصحراوية الرملية وتغطي السيارات والأماكن الرقيقة والزوايا والأثاث وينصح مرضى الربو والجهاز الطبي التنفسي بالابتعاد الشديد والوقاية منها بشراسة؟", a:"غبار"},

    // حرف الفاء
    {letter: 'ف', q:"المادة السوداء القاحمة والصلبة والقابلة جدا وبقوة للاشتعال المتزايد الدخاني وتستخدم للشواء والتدفئة وتستخرج من أشجار محترقة ومن مناجم عميقة ومظلمة تحت الأرض وتتسبب بتلوث واسع وكثيف للهواء الجوي؟", a:"فحم"},
    {letter: 'ف', q:"حيوان قارض ومتعجرف، ذيله طويل أطول من جسده، وصغير الحجم، يخاف منه الكثيرون ويخربه ويقضم الأوراق وتطارده القطط المنزلية ليلاً دون توقف وتراه في الكرتون الشهير (توم وجيري) ذكياً خبيثاً سحرياً لا ينام؟", a:"فأر"},
    {letter: 'ف', q:"الرداء النسائي الناعم والطويل والقصير ذو الأقمشة الناعمة والألوان البديعة الجذابة والمخصص للبنات يُلبس بفرح للمناسبات الاحتفالية السعيدة وحفلات التخرج العرقية المتميزة والزفاف الأبيض الفضي الملكي الخرافي الحالم؟", a:"فستان"},
    {letter: 'ف', q:"معدن نفيس وأبيض وعزيز جدا يستعمل وبشراهة في الزينة والخواتم وصنع الكؤوس والميداليات و يحل في المركز الثاني دائما بعد الذهب من حيث الجودة والسعر وتأثيره البراق الخالي من الصدأ والزمن المستمد من البريق المعتمد الثابث للرجال خصوصا؟", a:"فضة"},

    // حرف القاف
    {letter: 'ق', q:"مشروب ورمز عربي منبه وأساسي ذو لون داكن ومنشط و يطرد النوم ويُصنع من حبوب البن المحمص المطحون والممزوجة بالهيل والزعفران الدافئ و يُصب للمشايخ والضيوف في الفناجيل الذهبية المعطرة الطيسبة الممزوجة بالكرم؟", a:"قهوة"},
    {letter: 'ق', q:"الأداة الحديدية أو النحاسية الصلبة والآمنة المستخدمة للحماية من السرقة وقفل الأبواب ولا يتم فتحها أبداً ولا يمكن تحرير أقفالها الضمنية إلا عن طريق (المفتاح) الصحيح الخاص بأسنانها المدببة بالداخل لضمان الخصوصية والسلامة الحتمية والحقيقية المتينة الدقيقة السرية؟", a:"قفل"},
    {letter: 'ق', q:"النبات الزراعي والأبيض جدا كالثلج الناعم كالحرير والخفيف والذي تجمع قمعته لتُصنع منها أنعم وأفضل المنسوجات والملابس والمفارش البيضاء الناصعة والمنشفات للجسد وينمو بغزارة في الحقل والمناخ المتدفق المائي والحار كزراعات الشرق الأوسط والأمريكية الجميلة الحاضرة بالبياض والصحة الوافرة؟", a:"قطن"},
    {letter: 'ق', q:"وسيلة نقل برية طويلة وسريعة قوية جدا تسير بانتظام وتنتقل على سكتين حديديتين طويليتين تجوب الدول، وكان يعمل قديماً بالبخار واليوم يعمل بالكهرباء الرصاصية النفاثة لتنقل آلاف الركاب وتختصر أياماً من السفر الممل والمتعب بين القرى النائية والمدن الضخمة الحديثة؟", a:"قطار"},

    // حرف الكاف
    {letter: 'ك', q:"جرم سماوي معتم وهائل الحجم يدور في مدار ثابت ومسار حول نجم ضخم كالشمس مثل كرتنا (الأرض) الجميلة ويمتاز بعدد كبير منه في مجرتنا؟", a:"كوكب"},
    {letter: 'ك', q:"الوعاء المجوف الصغير أو الكبير الذي يُشرب فيه الماء العصائر والشاي ويصنع قديما وحديثا من الزجاج الراقي أو البلاستيك المقوى المتعدد الاستعمالات والورق الساخن العازل؟", a:"كوب"},
    {letter: 'ك', q:"الوصفة والحلوى الشهية الدائرية والمخبوزة بالكريمة، والتي تصنع و تُقدم مزينة ومزخرفة في الأفراح الخاصة والمناسبات البارزة العرقية وتطفأ فوقها الشموع المتراقصة بنفخة هواء رقيقة للتهنئات الصادقة المبهجة والممتعة للروح؟", a:"كعكة (كيكة)"},
    {letter: 'ك', q:"الدولة الخليجية الصغيرة التي عاصمتها بنفس الاسم الجميل وتشتهر بأبراجها الثلاثة العالية المطلة على الخليج العربي وثقافتها الإعلامية والفنية الخليجية ومسرحياتها النادرة المضحكة والتاريخ الرخيص والطويل والصبر والتعافي المعرفي المستمد من الصحراء المفتوحة الساحرة للمتأمل البحري؟", a:"كويت (الكويت)"},

    // حرف اللام
    {letter: 'ل', q:"الصبغة البصرية النورانية المتبلورة والعاكسة للعين كالأحمر الأزرق الأخضر التي نراها ونميز بها الأشياء والأطياف في حياتنا وكل ما حولنا بالكون لنفرق بين الجمال والكآبة والرؤية القاتمة والطبيعية المورقة واللوحات الزيتية الخلابة الممزوجة والخاطفة للنظر؟", a:"لون"},
    {letter: 'ل', q:"الرياضي النشيط الذي يشارك بحماس ومهارة عالية ومراوغات فردية في لعبة رياضية وخصوصا في كرة القدم والتنس والطائرة ويشعل الجماهير الغفيرة ويسجل الانتصارات والتسجيلات الرقمية المرعبة للفوز بالميداليات؟", a:"لاعب"},
    {letter: 'ل', q:"السارق المتخفي الذي يعتمد على الدهاء والخداع والظلام والسرعة لكي يسرق أو يختلس ممتلكات وأموال وحقوق الآخرين خفية بعيدا عن أعين الناس ويفر هربا لكي لا يُقبض عليه ويواجه العدالة والقضاء والأحكام الحديدية الغليظة الصارمة؟", a:"لص"},
    {letter: 'ل', q:"الدولة العربية الشقيقة التي تقع في الشمال القاري وتجاور مصر من الغرب و يقال عنها بلد عمر المختار وتملك موارد قوية و طابعا حيويا وصحراويا لا ينسى ومساحات خضراء وسلسلة مدن متوسطية وخطاً ساحلياً عظيم الجمال والثقافة القديمة الملونة والعربية الشهمة الساحرة الأصيلة الفخمة القائمة؟", a:"ليبيا"},

    // حرف الميم
    {letter: 'م', q:"البناء الهندسي الإسلامي والمكان الطاهر المخصص للعبادة، وصلاة الجماعة للمسلمين وإقامة الشعائر الدينية الخاشعة ويتوضأ الناس ليذهبوا إليه ويحوي المئذنة العالية ليرفع فيها الأذان بصدى الروح والصوت الرنان الخالي من الصخب الروحاني والمطمئن؟", a:"مسجد (جامع)"},
    {letter: 'م', q:"المكان المدني الشاسع والمنظم جدا والمدرج بإقلاع رحلات السفر الفضائية والجوية وفيه تهبط وتقلع الطائرات العملاقة وتلتقي فيه الناس وتودع بعضها للسفر والعبور بين القارات والتذوق الثقافي والدولي والأسواط الحرة الكبرى والأسواق الحرة والمنارات الضخمة المضيئة الرائدة للملاحة المستمرة 24 ساعة؟", a:"مطار"},
    {letter: 'م', q:"الأداة المعدنية أو الخشبية اليدوية الصغيرة الأساسية التي نستخدمها في تناول وجبات الشوربة السائلة والأرز والطعام الذي يصعب مسكه، وهي رديف ملازم ولا ينفصل بالشكل والتطبيق عن الشوكة في ثقافة المطبخ الموضعي والحيوي الجاهز والمطاعم؟", a:"ملعقة"},
    {letter: 'م', q:"السطح الزجاجي أو المعدني المصقول والذي يعكس صورة وشكل الأشياء التي أمامه بشكل دقيق لا يصدق ونرى أنفسنا فيها كل صباح و تتواجد بمختلف أحجامها وأشكالها الفريدة في المنازل وحقائب النساء وتحدثنا عن الجمال والهندام والأناقة وترتيب الشعر بوضوح صارم ولامع وقوي الانعكاس الكامل اللامحدود؟", a:"مرآة (منظرة)"},

    // حرف النون
    {letter: 'ن', q:"الجرم السماوي الغازي المضيء بقوة، وبعيد جداً ويشع و يتلألأ في كبد السماء ليلاً ويهدي ويستدل به القدماء للبوصلة والمعرفة للبحار والصحاري وله مسارات ومجسمات خماسية أطلق عليها الأساطير الأبرز كالأبراج والمشاهير اللامعة البعيدة والثاقبة النور المتوهجة الغابرة النقطية والسريابيل الرقيقة المشتتلة؟", a:"نجمة"},
    {letter: 'ن', q:"الفتحة الزجاجية أو الخشبية الموجودة والمضمنة في الجدار للاطلاع والتهوية ولدخول أشعة الضوء والهواء النقي الصبحي للمنزل والغرفة وهي النافذة التي نطل منها للمستقبل والمدن الخلابة والحياة والحارة ونلقي التحية وتطل على الأمل والنور الفوار والممطر المحبب و الهواء العليل والمشمس؟", a:"نافذة (دريشة / شباك)"},
    {letter: 'ن', q:"الحالة البيولوجية والاسترخاء والتوقف المؤقت للإدراك الواعي واللاوعي اليومية والتي يفقد فيها الإنسان سيطرته بشكل عميق، ولها فوائد إعجازية عظيمة صحية، وتلتقط الأنفاس وتعيد الطاقة والتجدد والمزاج والابتعاد المؤقت وتأتي بالرؤى الجلية والأحلام والراحات و النعاس الجميل والهدوء الهامس اللامحدود؟", a:"نوم"},
    {letter: 'ن', q:"الحشرة الحيوية والمميزة والنافعة جداً، المجتهدة التي تُنتج وتبني الخلايا المعقدة بطريقة سداسية الأضلاع مذهلة جدا وتطير متنقلة ورشيقة بين رحيق الأزهار العبقة، وذُكرت بسورة كاملة بالقرآن وجعلها الله سببا في الشفاء والشراب الطبي واللذيذ المفيد والعلاج المعجز الذهبي الخالي من الأضرار الجسدية والمعزز للمناعة والدورة المكتملة الفعالة الفذة؟", a:"نحلة"},

    // حرف الهاء
    {letter: 'هـ', q:"الهدية والهبة والتكريمة البسيطة أو الفاخرة التي يُعطيها ويهديها لك شخص تعبيراً عن الحب والمودة والصداقة المتينة العميقة ولا ينتظر منها مقابلا ماليا لترسيخ وتعزيز الروابط وتقريب الفجوات ومحو العداوات وهي المفتاح العشقي والإخائي والإنساني الدقيق والعبق والتغليف المفرح والرقيق الشاعري جدا والمؤثر للقلب المتصافي؟", a:"هدية"},
    {letter: 'هـ', q:"الإطار العظمي والتكوين الداخلي الرئيسي الغريب الذي يحدد بنية وشكل ودعامة الإنسان والحيوان ويدفن ويتحلل ويبدو مفزعاً بعد الممات وبقائه الطويل، ويدرسه الأطباء بالتشريح المعقد ويواجهونه بكسور الجبائر والحوادث المتهشمة الصعبة والإستمرار لحفظ واستقامة الجسم للغضاريف والعظام المتراصة المعمرة والمتكلسة؟", a:"هيكل"},
    {letter: 'هـ', q:"الدولة الآسيوية العملاقة والضخمة بالسكان والزحام، والتي تفوح منها روائح التوابل الزاكية والزعفران والمعابد القديمة، وتشهد الفيلة وصناعة وتاريخ الأرقام وتقع في جنوب آسيا وتشهر بقطار الموت وزحام الشوارع المهولة والتاريخ الفني والبهارات وتاج محل الناصع والمذهل الساحر المبهر العتيق المتعدد الحضارات؟", a:"هند (الهند)"},
    
    // حرف الواو
    {letter: 'و', q:"المقياس الزمني المحسوب بالنبض والساعات والأيام والسنوات الذهبية والسيف البتار الذي لا يرحم إذا أضاعه الكسالى والشباب، ويمضي بلا رجعة ولا توقف ولن تسترجعه ملايين الدولارات وهو الحقيقة الوحيدة المستمرة والتي تنهي الأعمال والنهايات للمواعيد والالتزامات والمواسم الكروية والإنجازات العظيمة للمنظمين والمتيقظين الكبار الصارمين للحزم المنجز والصارم والدقيق الأكيد الثمين المحدود العابر المتكرر المتدفق بلا صبر وتراجع وعودة مستحيلة؟", a:"وقت"},
    {letter: 'و', q:"الابن والخلف للمستقبل والذكر من البشر والصبي الصغير في سنوات المهد والنمو واللعب والشباب الناضج والصبي والصعلوك المدلل في المنزل والحارث والباني للحاضر والطاقات والمستغمر بالأحلام المتهورة والنجاحات الوهمية والمبتكرة والمنقذ الحقيقي لحمل العائلة والوريث للحضارة والجيل الخالد والجموح البريء العالي والضجة المثمرة المبدعة والعزيمة المشوقة للمستقبل المورق الواعد المفتوح والمتعطش للتجربة والخوض الجامح والطبيعة البشرية المندفعة والمتلهفة للنجاحات المغامرة العالية الغامضة المتكررة المتكاثرة المتأهبة الجسورة؟", a:"ولد"},
    {letter: 'و', q:"الوسادة الفاخرة والناعمة والمريحة جدا والمحشوة بالقطن الصافي والنظيف والمستخدمة باسترخاء والمكان الذي نضع ونريح فيه رؤوسنا الثقيلة المرهقة والمثقلة بالهموم والعمل والنوم الجاد المتواصل والكسل في دورة الأحلام وتجلب الراحة والانتعاش و الطهارة الروحية الجسدية الهادئة والمخملية الخالصة والمفرحة الهانئة الحاضنة المطمئنة الممتلئة السابحة بالسبات والطير والغيوم والأمنيات الهادئة المغلقة المرتاحة المطوية العميقة الأفقية المنضوية المنتهية المأوى النائية الناقصة الغارقة المؤقتة؟ -> باختصار (مخدة تُوضع تحت الرأس مريحة للنوم)", a:"وسادة (مخدة)"}, // simplified
    // Oops, I can simplify the text slightly for 'وجه'
    {letter: 'و', q:"الجزء الأمامي المهم والمميز والحساس من الرأس والذي يحتوي الملامح وتظهر فيه الانفعالات الغاضبة والفرحة والابتسامات العريضة وهو الهوية الأولى للعينان والأنف والشفاه ويعبر عن الجمال والحسن للبشر والمظهر الأهم للقبول والنظرة والكاريزما البليغة للتعرف والمواجهة البصرية والمصداقية المطلقة المرتاحة والخجل والفخر والثبات والصورة الحقيقية للمغزى والانطباعات؟", a:"وجه"},

    // حرف الياء
    {letter: 'ي', q:"الزهرة البيضاء العطرية الرقيقة والصغيرة والمشهورة جداً بأريجها الفواح والمميز وزيتها العذب وشعبيتها بين العطور الفاخرة والتي يتغنى بها الشعراء وتزين الحدائق الشامية الساحرة لجمالها البهي وصغر حجمها وبريقها الناصع المتألق جدا والمشعة والمشرقة صباحا والمورقة الخالصة الجميلة الناصعة؟", a:"ياسمين"},
    {letter: 'ي', q:"الفترة الزمنية الحياتية والمقاسة التي مدتها 24 ساعة بالضبط واعتبرت الوحدة الأساسية لدوران الأرض حول محورها الدقيق والتي تتعاقب فيها وتتبادل فيها فترات الليل المظلم والنهار الساطع لتعطينا الجدول والتوازن والفصول والمواسم المتكررة الثابتة المنسدلة والعابث المتدحرجة المستمرة الروتينية الخالصة المؤقتة المنتظمة المسترسلة الأهم الدؤوبة والمقاسة والمعدودة؟", a:"يوم"},
    {letter: 'ي', q:"الدولة العربية والإسلامية الكبيرة والشامخة وتُعرف في التاريخ بالـ (السعيد) وأصل العرب الحقيقي والحضارة وتمتلك طبيعة زراعية خضراء فاتنة ومدناً معلقة وقلاع وتاريخ عريق جدا من سبأ وملكتهم وسد مأرب الصخري وتعرف بشجاعة شعبها وتضاريسها الخشنة المحببة والجذر العميق الممتد العربي الجبالي القوي والعمق التاريخي المؤثر والهام بالروح العربية المدمجة والفاخرة والمتماسكة الخالصة البديعة الغالية والأصول المشدودة للعروبة العبقة الحقيقية الفذة المدهشة؟", a:"يمن (اليمن)"},

    // النجمة (أسئلة عامة وألعاب و أنمي وتقنية سريعة)
    {letter: '★', q:"التطبيق الصيني الفيروسي الذي اكتسح و غزا العالم بأسره والمتخصص بشكل عبقري بنشر الفيديوهات القصيرة الموسيقية والتحديات و(الترندات) والرقصات والمنصة الأولى حاليا للشباب والمراهقين والإعلانات الخاطفة وتسبب للعديد من الدول القلق السياسي والنجاح الأسطوري الموازي والمبهر الخيالي الساخن جدا؟", a:"تيك توك (TikTok)"},
    {letter: '★', q:"اللعبة التاريخية المليارية الكلاسيكية والأكثر مبيعاً في التاريخ بأكمله وبلا منازع، والتي انطلقت من فكرة بسيطة تتيح البناء بالمربعات والمكعبات البكسلية والإبداع الغير محدود وكسر الأخشاب ومواجهة وحش الكريبر والزومبي بالمغارات والنجاة وبناء العوالم الضخمة جدا ومملوكة لمايكروسوفت الفائقة والمدهشة الجذابة والخلاقة والممتعة والمسترسلة الغنية المتكاملة العميقة الفذّة المتميزة والمتقطعة العظيمة والساحرة العزلة والمزدحمة الجماعية المستمرة الناعمة؟", a:"ماين كرافت (Minecraft)"},
    {letter: '★', q:"الشركة الأمريكية التقنية والإلكترونية الأعظم على الإطلاق، صاحبة شعار وعلامة (التفاحة المقضومة) المميزة والمخترعة الأبدية للثورة الذكية في الهواتف المدمجة والفاخرة (الآيفون والآيباد والماك)، والتي أسسها العقل المدبر والمبدع ستيف جوبز واعتلت الاقتصاد العالمي والمبيعات المرعبة والنظام المغلق الآمن العصي الدقيق والمبتكر والمؤثر والمميز الصارم المتفوق القاضي الباهض؟", a:"أبل (Apple)"},
    {letter: '★', q:"الأنمي الياباني الأسطوري القتالي الخالد الذي حفر بالذاكرة الذهبية، والذي يجمع شخصياته كرات التنين وصاحبه بطل يُدعى غوكو (كاكاروتو) و رفيقه المنافس الشرس فيجيتا للدفاع عن الأرض والمجرات وتحقيق التحولات الفائقة (السوبر سايان) الصارخة والشعر الأصفر المحترق والفنون القتالية الفضائية المتفجرة المبهرة ذات الهالات الشعاعية الخرافية الضخمة والعنيفة الجذابة الحية العميقة المتجددة والمميزة المشتعلة الهائلة والمزلزلة الفنية الأسطورية الحازمة؟", a:"دراغون بول (Dragon ball Z)"}
];

// دمج الدفعة الثانية مع قاعدة البيانات الأساسية
if (typeof externalQuestionsDB !== 'undefined') {
    batch2.forEach(item => {
        if (externalQuestionsDB[item.letter]) {
            externalQuestionsDB[item.letter].push({q: item.q, a: item.a});
        }
    });
}
